----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 48, 48]           9,408
       BatchNorm2d-2           [-1, 64, 48, 48]             128
              ReLU-3           [-1, 64, 48, 48]               0
         MaxPool2d-4           [-1, 64, 24, 24]               0
       BatchNorm2d-5           [-1, 64, 24, 24]             128
              ReLU-6           [-1, 64, 24, 24]               0
            Conv2d-7          [-1, 128, 24, 24]           8,192
       BatchNorm2d-8          [-1, 128, 24, 24]             256
              ReLU-9          [-1, 128, 24, 24]               0
           Conv2d-10           [-1, 32, 24, 24]          36,864
      BatchNorm2d-11           [-1, 96, 24, 24]             192
             ReLU-12           [-1, 96, 24, 24]               0
           Conv2d-13          [-1, 128, 24, 24]          12,288
      BatchNorm2d-14          [-1, 128, 24, 24]             256
             ReLU-15          [-1, 128, 24, 24]               0
           Conv2d-16           [-1, 32, 24, 24]          36,864
      BatchNorm2d-17          [-1, 128, 24, 24]             256
             ReLU-18          [-1, 128, 24, 24]               0
           Conv2d-19          [-1, 128, 24, 24]          16,384
      BatchNorm2d-20          [-1, 128, 24, 24]             256
             ReLU-21          [-1, 128, 24, 24]               0
           Conv2d-22           [-1, 32, 24, 24]          36,864
      BatchNorm2d-23          [-1, 160, 24, 24]             320
             ReLU-24          [-1, 160, 24, 24]               0
           Conv2d-25          [-1, 128, 24, 24]          20,480
      BatchNorm2d-26          [-1, 128, 24, 24]             256
             ReLU-27          [-1, 128, 24, 24]               0
           Conv2d-28           [-1, 32, 24, 24]          36,864
      BatchNorm2d-29          [-1, 192, 24, 24]             384
             ReLU-30          [-1, 192, 24, 24]               0
           Conv2d-31          [-1, 128, 24, 24]          24,576
      BatchNorm2d-32          [-1, 128, 24, 24]             256
             ReLU-33          [-1, 128, 24, 24]               0
           Conv2d-34           [-1, 32, 24, 24]          36,864
      BatchNorm2d-35          [-1, 224, 24, 24]             448
             ReLU-36          [-1, 224, 24, 24]               0
           Conv2d-37          [-1, 128, 24, 24]          28,672
      BatchNorm2d-38          [-1, 128, 24, 24]             256
             ReLU-39          [-1, 128, 24, 24]               0
           Conv2d-40           [-1, 32, 24, 24]          36,864
      BatchNorm2d-41          [-1, 256, 24, 24]             512
             ReLU-42          [-1, 256, 24, 24]               0
           Conv2d-43          [-1, 128, 24, 24]          32,768
        AvgPool2d-44          [-1, 128, 12, 12]               0
      BatchNorm2d-45          [-1, 128, 12, 12]             256
             ReLU-46          [-1, 128, 12, 12]               0
           Conv2d-47          [-1, 128, 12, 12]          16,384
      BatchNorm2d-48          [-1, 128, 12, 12]             256
             ReLU-49          [-1, 128, 12, 12]               0
           Conv2d-50           [-1, 32, 12, 12]          36,864
      BatchNorm2d-51          [-1, 160, 12, 12]             320
             ReLU-52          [-1, 160, 12, 12]               0
           Conv2d-53          [-1, 128, 12, 12]          20,480
      BatchNorm2d-54          [-1, 128, 12, 12]             256
             ReLU-55          [-1, 128, 12, 12]               0
           Conv2d-56           [-1, 32, 12, 12]          36,864
      BatchNorm2d-57          [-1, 192, 12, 12]             384
             ReLU-58          [-1, 192, 12, 12]               0
           Conv2d-59          [-1, 128, 12, 12]          24,576
      BatchNorm2d-60          [-1, 128, 12, 12]             256
             ReLU-61          [-1, 128, 12, 12]               0
           Conv2d-62           [-1, 32, 12, 12]          36,864
      BatchNorm2d-63          [-1, 224, 12, 12]             448
             ReLU-64          [-1, 224, 12, 12]               0
           Conv2d-65          [-1, 128, 12, 12]          28,672
      BatchNorm2d-66          [-1, 128, 12, 12]             256
             ReLU-67          [-1, 128, 12, 12]               0
           Conv2d-68           [-1, 32, 12, 12]          36,864
      BatchNorm2d-69          [-1, 256, 12, 12]             512
             ReLU-70          [-1, 256, 12, 12]               0
           Conv2d-71          [-1, 128, 12, 12]          32,768
      BatchNorm2d-72          [-1, 128, 12, 12]             256
             ReLU-73          [-1, 128, 12, 12]               0
           Conv2d-74           [-1, 32, 12, 12]          36,864
      BatchNorm2d-75          [-1, 288, 12, 12]             576
             ReLU-76          [-1, 288, 12, 12]               0
           Conv2d-77          [-1, 128, 12, 12]          36,864
      BatchNorm2d-78          [-1, 128, 12, 12]             256
             ReLU-79          [-1, 128, 12, 12]               0
           Conv2d-80           [-1, 32, 12, 12]          36,864
      BatchNorm2d-81          [-1, 320, 12, 12]             640
             ReLU-82          [-1, 320, 12, 12]               0
           Conv2d-83          [-1, 128, 12, 12]          40,960
      BatchNorm2d-84          [-1, 128, 12, 12]             256
             ReLU-85          [-1, 128, 12, 12]               0
           Conv2d-86           [-1, 32, 12, 12]          36,864
      BatchNorm2d-87          [-1, 352, 12, 12]             704
             ReLU-88          [-1, 352, 12, 12]               0
           Conv2d-89          [-1, 128, 12, 12]          45,056
      BatchNorm2d-90          [-1, 128, 12, 12]             256
             ReLU-91          [-1, 128, 12, 12]               0
           Conv2d-92           [-1, 32, 12, 12]          36,864
      BatchNorm2d-93          [-1, 384, 12, 12]             768
             ReLU-94          [-1, 384, 12, 12]               0
           Conv2d-95          [-1, 128, 12, 12]          49,152
      BatchNorm2d-96          [-1, 128, 12, 12]             256
             ReLU-97          [-1, 128, 12, 12]               0
           Conv2d-98           [-1, 32, 12, 12]          36,864
      BatchNorm2d-99          [-1, 416, 12, 12]             832
            ReLU-100          [-1, 416, 12, 12]               0
          Conv2d-101          [-1, 128, 12, 12]          53,248
     BatchNorm2d-102          [-1, 128, 12, 12]             256
            ReLU-103          [-1, 128, 12, 12]               0
          Conv2d-104           [-1, 32, 12, 12]          36,864
     BatchNorm2d-105          [-1, 448, 12, 12]             896
            ReLU-106          [-1, 448, 12, 12]               0
          Conv2d-107          [-1, 128, 12, 12]          57,344
     BatchNorm2d-108          [-1, 128, 12, 12]             256
            ReLU-109          [-1, 128, 12, 12]               0
          Conv2d-110           [-1, 32, 12, 12]          36,864
     BatchNorm2d-111          [-1, 480, 12, 12]             960
            ReLU-112          [-1, 480, 12, 12]               0
          Conv2d-113          [-1, 128, 12, 12]          61,440
     BatchNorm2d-114          [-1, 128, 12, 12]             256
            ReLU-115          [-1, 128, 12, 12]               0
          Conv2d-116           [-1, 32, 12, 12]          36,864
     BatchNorm2d-117          [-1, 512, 12, 12]           1,024
            ReLU-118          [-1, 512, 12, 12]               0
          Conv2d-119          [-1, 256, 12, 12]         131,072
       AvgPool2d-120            [-1, 256, 6, 6]               0
     BatchNorm2d-121            [-1, 256, 6, 6]             512
            ReLU-122            [-1, 256, 6, 6]               0
          Conv2d-123            [-1, 128, 6, 6]          32,768
     BatchNorm2d-124            [-1, 128, 6, 6]             256
            ReLU-125            [-1, 128, 6, 6]               0
          Conv2d-126             [-1, 32, 6, 6]          36,864
     BatchNorm2d-127            [-1, 288, 6, 6]             576
            ReLU-128            [-1, 288, 6, 6]               0
          Conv2d-129            [-1, 128, 6, 6]          36,864
     BatchNorm2d-130            [-1, 128, 6, 6]             256
            ReLU-131            [-1, 128, 6, 6]               0
          Conv2d-132             [-1, 32, 6, 6]          36,864
     BatchNorm2d-133            [-1, 320, 6, 6]             640
            ReLU-134            [-1, 320, 6, 6]               0
          Conv2d-135            [-1, 128, 6, 6]          40,960
     BatchNorm2d-136            [-1, 128, 6, 6]             256
            ReLU-137            [-1, 128, 6, 6]               0
          Conv2d-138             [-1, 32, 6, 6]          36,864
     BatchNorm2d-139            [-1, 352, 6, 6]             704
            ReLU-140            [-1, 352, 6, 6]               0
          Conv2d-141            [-1, 128, 6, 6]          45,056
     BatchNorm2d-142            [-1, 128, 6, 6]             256
            ReLU-143            [-1, 128, 6, 6]               0
          Conv2d-144             [-1, 32, 6, 6]          36,864
     BatchNorm2d-145            [-1, 384, 6, 6]             768
            ReLU-146            [-1, 384, 6, 6]               0
          Conv2d-147            [-1, 128, 6, 6]          49,152
     BatchNorm2d-148            [-1, 128, 6, 6]             256
            ReLU-149            [-1, 128, 6, 6]               0
          Conv2d-150             [-1, 32, 6, 6]          36,864
     BatchNorm2d-151            [-1, 416, 6, 6]             832
            ReLU-152            [-1, 416, 6, 6]               0
          Conv2d-153            [-1, 128, 6, 6]          53,248
     BatchNorm2d-154            [-1, 128, 6, 6]             256
            ReLU-155            [-1, 128, 6, 6]               0
          Conv2d-156             [-1, 32, 6, 6]          36,864
     BatchNorm2d-157            [-1, 448, 6, 6]             896
            ReLU-158            [-1, 448, 6, 6]               0
          Conv2d-159            [-1, 128, 6, 6]          57,344
     BatchNorm2d-160            [-1, 128, 6, 6]             256
            ReLU-161            [-1, 128, 6, 6]               0
          Conv2d-162             [-1, 32, 6, 6]          36,864
     BatchNorm2d-163            [-1, 480, 6, 6]             960
            ReLU-164            [-1, 480, 6, 6]               0
          Conv2d-165            [-1, 128, 6, 6]          61,440
     BatchNorm2d-166            [-1, 128, 6, 6]             256
            ReLU-167            [-1, 128, 6, 6]               0
          Conv2d-168             [-1, 32, 6, 6]          36,864
     BatchNorm2d-169            [-1, 512, 6, 6]           1,024
            ReLU-170            [-1, 512, 6, 6]               0
          Conv2d-171            [-1, 128, 6, 6]          65,536
     BatchNorm2d-172            [-1, 128, 6, 6]             256
            ReLU-173            [-1, 128, 6, 6]               0
          Conv2d-174             [-1, 32, 6, 6]          36,864
     BatchNorm2d-175            [-1, 544, 6, 6]           1,088
            ReLU-176            [-1, 544, 6, 6]               0
          Conv2d-177            [-1, 128, 6, 6]          69,632
     BatchNorm2d-178            [-1, 128, 6, 6]             256
            ReLU-179            [-1, 128, 6, 6]               0
          Conv2d-180             [-1, 32, 6, 6]          36,864
     BatchNorm2d-181            [-1, 576, 6, 6]           1,152
            ReLU-182            [-1, 576, 6, 6]               0
          Conv2d-183            [-1, 128, 6, 6]          73,728
     BatchNorm2d-184            [-1, 128, 6, 6]             256
            ReLU-185            [-1, 128, 6, 6]               0
          Conv2d-186             [-1, 32, 6, 6]          36,864
     BatchNorm2d-187            [-1, 608, 6, 6]           1,216
            ReLU-188            [-1, 608, 6, 6]               0
          Conv2d-189            [-1, 128, 6, 6]          77,824
     BatchNorm2d-190            [-1, 128, 6, 6]             256
            ReLU-191            [-1, 128, 6, 6]               0
          Conv2d-192             [-1, 32, 6, 6]          36,864
     BatchNorm2d-193            [-1, 640, 6, 6]           1,280
            ReLU-194            [-1, 640, 6, 6]               0
          Conv2d-195            [-1, 128, 6, 6]          81,920
     BatchNorm2d-196            [-1, 128, 6, 6]             256
            ReLU-197            [-1, 128, 6, 6]               0
          Conv2d-198             [-1, 32, 6, 6]          36,864
     BatchNorm2d-199            [-1, 672, 6, 6]           1,344
            ReLU-200            [-1, 672, 6, 6]               0
          Conv2d-201            [-1, 128, 6, 6]          86,016
     BatchNorm2d-202            [-1, 128, 6, 6]             256
            ReLU-203            [-1, 128, 6, 6]               0
          Conv2d-204             [-1, 32, 6, 6]          36,864
     BatchNorm2d-205            [-1, 704, 6, 6]           1,408
            ReLU-206            [-1, 704, 6, 6]               0
          Conv2d-207            [-1, 128, 6, 6]          90,112
     BatchNorm2d-208            [-1, 128, 6, 6]             256
            ReLU-209            [-1, 128, 6, 6]               0
          Conv2d-210             [-1, 32, 6, 6]          36,864
     BatchNorm2d-211            [-1, 736, 6, 6]           1,472
            ReLU-212            [-1, 736, 6, 6]               0
          Conv2d-213            [-1, 128, 6, 6]          94,208
     BatchNorm2d-214            [-1, 128, 6, 6]             256
            ReLU-215            [-1, 128, 6, 6]               0
          Conv2d-216             [-1, 32, 6, 6]          36,864
     BatchNorm2d-217            [-1, 768, 6, 6]           1,536
            ReLU-218            [-1, 768, 6, 6]               0
          Conv2d-219            [-1, 128, 6, 6]          98,304
     BatchNorm2d-220            [-1, 128, 6, 6]             256
            ReLU-221            [-1, 128, 6, 6]               0
          Conv2d-222             [-1, 32, 6, 6]          36,864
     BatchNorm2d-223            [-1, 800, 6, 6]           1,600
            ReLU-224            [-1, 800, 6, 6]               0
          Conv2d-225            [-1, 128, 6, 6]         102,400
     BatchNorm2d-226            [-1, 128, 6, 6]             256
            ReLU-227            [-1, 128, 6, 6]               0
          Conv2d-228             [-1, 32, 6, 6]          36,864
     BatchNorm2d-229            [-1, 832, 6, 6]           1,664
            ReLU-230            [-1, 832, 6, 6]               0
          Conv2d-231            [-1, 128, 6, 6]         106,496
     BatchNorm2d-232            [-1, 128, 6, 6]             256
            ReLU-233            [-1, 128, 6, 6]               0
          Conv2d-234             [-1, 32, 6, 6]          36,864
     BatchNorm2d-235            [-1, 864, 6, 6]           1,728
            ReLU-236            [-1, 864, 6, 6]               0
          Conv2d-237            [-1, 128, 6, 6]         110,592
     BatchNorm2d-238            [-1, 128, 6, 6]             256
            ReLU-239            [-1, 128, 6, 6]               0
          Conv2d-240             [-1, 32, 6, 6]          36,864
     BatchNorm2d-241            [-1, 896, 6, 6]           1,792
            ReLU-242            [-1, 896, 6, 6]               0
          Conv2d-243            [-1, 128, 6, 6]         114,688
     BatchNorm2d-244            [-1, 128, 6, 6]             256
            ReLU-245            [-1, 128, 6, 6]               0
          Conv2d-246             [-1, 32, 6, 6]          36,864
     BatchNorm2d-247            [-1, 928, 6, 6]           1,856
            ReLU-248            [-1, 928, 6, 6]               0
          Conv2d-249            [-1, 128, 6, 6]         118,784
     BatchNorm2d-250            [-1, 128, 6, 6]             256
            ReLU-251            [-1, 128, 6, 6]               0
          Conv2d-252             [-1, 32, 6, 6]          36,864
     BatchNorm2d-253            [-1, 960, 6, 6]           1,920
            ReLU-254            [-1, 960, 6, 6]               0
          Conv2d-255            [-1, 128, 6, 6]         122,880
     BatchNorm2d-256            [-1, 128, 6, 6]             256
            ReLU-257            [-1, 128, 6, 6]               0
          Conv2d-258             [-1, 32, 6, 6]          36,864
     BatchNorm2d-259            [-1, 992, 6, 6]           1,984
            ReLU-260            [-1, 992, 6, 6]               0
          Conv2d-261            [-1, 128, 6, 6]         126,976
     BatchNorm2d-262            [-1, 128, 6, 6]             256
            ReLU-263            [-1, 128, 6, 6]               0
          Conv2d-264             [-1, 32, 6, 6]          36,864
     BatchNorm2d-265           [-1, 1024, 6, 6]           2,048
            ReLU-266           [-1, 1024, 6, 6]               0
          Conv2d-267            [-1, 128, 6, 6]         131,072
     BatchNorm2d-268            [-1, 128, 6, 6]             256
            ReLU-269            [-1, 128, 6, 6]               0
          Conv2d-270             [-1, 32, 6, 6]          36,864
     BatchNorm2d-271           [-1, 1056, 6, 6]           2,112
            ReLU-272           [-1, 1056, 6, 6]               0
          Conv2d-273            [-1, 128, 6, 6]         135,168
     BatchNorm2d-274            [-1, 128, 6, 6]             256
            ReLU-275            [-1, 128, 6, 6]               0
          Conv2d-276             [-1, 32, 6, 6]          36,864
     BatchNorm2d-277           [-1, 1088, 6, 6]           2,176
            ReLU-278           [-1, 1088, 6, 6]               0
          Conv2d-279            [-1, 128, 6, 6]         139,264
     BatchNorm2d-280            [-1, 128, 6, 6]             256
            ReLU-281            [-1, 128, 6, 6]               0
          Conv2d-282             [-1, 32, 6, 6]          36,864
     BatchNorm2d-283           [-1, 1120, 6, 6]           2,240
            ReLU-284           [-1, 1120, 6, 6]               0
          Conv2d-285            [-1, 128, 6, 6]         143,360
     BatchNorm2d-286            [-1, 128, 6, 6]             256
            ReLU-287            [-1, 128, 6, 6]               0
          Conv2d-288             [-1, 32, 6, 6]          36,864
     BatchNorm2d-289           [-1, 1152, 6, 6]           2,304
            ReLU-290           [-1, 1152, 6, 6]               0
          Conv2d-291            [-1, 128, 6, 6]         147,456
     BatchNorm2d-292            [-1, 128, 6, 6]             256
            ReLU-293            [-1, 128, 6, 6]               0
          Conv2d-294             [-1, 32, 6, 6]          36,864
     BatchNorm2d-295           [-1, 1184, 6, 6]           2,368
            ReLU-296           [-1, 1184, 6, 6]               0
          Conv2d-297            [-1, 128, 6, 6]         151,552
     BatchNorm2d-298            [-1, 128, 6, 6]             256
            ReLU-299            [-1, 128, 6, 6]               0
          Conv2d-300             [-1, 32, 6, 6]          36,864
     BatchNorm2d-301           [-1, 1216, 6, 6]           2,432
            ReLU-302           [-1, 1216, 6, 6]               0
          Conv2d-303            [-1, 128, 6, 6]         155,648
     BatchNorm2d-304            [-1, 128, 6, 6]             256
            ReLU-305            [-1, 128, 6, 6]               0
          Conv2d-306             [-1, 32, 6, 6]          36,864
     BatchNorm2d-307           [-1, 1248, 6, 6]           2,496
            ReLU-308           [-1, 1248, 6, 6]               0
          Conv2d-309            [-1, 128, 6, 6]         159,744
     BatchNorm2d-310            [-1, 128, 6, 6]             256
            ReLU-311            [-1, 128, 6, 6]               0
          Conv2d-312             [-1, 32, 6, 6]          36,864
     BatchNorm2d-313           [-1, 1280, 6, 6]           2,560
            ReLU-314           [-1, 1280, 6, 6]               0
          Conv2d-315            [-1, 128, 6, 6]         163,840
     BatchNorm2d-316            [-1, 128, 6, 6]             256
            ReLU-317            [-1, 128, 6, 6]               0
          Conv2d-318             [-1, 32, 6, 6]          36,864
     BatchNorm2d-319           [-1, 1312, 6, 6]           2,624
            ReLU-320           [-1, 1312, 6, 6]               0
          Conv2d-321            [-1, 128, 6, 6]         167,936
     BatchNorm2d-322            [-1, 128, 6, 6]             256
            ReLU-323            [-1, 128, 6, 6]               0
          Conv2d-324             [-1, 32, 6, 6]          36,864
     BatchNorm2d-325           [-1, 1344, 6, 6]           2,688
            ReLU-326           [-1, 1344, 6, 6]               0
          Conv2d-327            [-1, 128, 6, 6]         172,032
     BatchNorm2d-328            [-1, 128, 6, 6]             256
            ReLU-329            [-1, 128, 6, 6]               0
          Conv2d-330             [-1, 32, 6, 6]          36,864
     BatchNorm2d-331           [-1, 1376, 6, 6]           2,752
            ReLU-332           [-1, 1376, 6, 6]               0
          Conv2d-333            [-1, 128, 6, 6]         176,128
     BatchNorm2d-334            [-1, 128, 6, 6]             256
            ReLU-335            [-1, 128, 6, 6]               0
          Conv2d-336             [-1, 32, 6, 6]          36,864
     BatchNorm2d-337           [-1, 1408, 6, 6]           2,816
            ReLU-338           [-1, 1408, 6, 6]               0
          Conv2d-339            [-1, 128, 6, 6]         180,224
     BatchNorm2d-340            [-1, 128, 6, 6]             256
            ReLU-341            [-1, 128, 6, 6]               0
          Conv2d-342             [-1, 32, 6, 6]          36,864
     BatchNorm2d-343           [-1, 1440, 6, 6]           2,880
            ReLU-344           [-1, 1440, 6, 6]               0
          Conv2d-345            [-1, 128, 6, 6]         184,320
     BatchNorm2d-346            [-1, 128, 6, 6]             256
            ReLU-347            [-1, 128, 6, 6]               0
          Conv2d-348             [-1, 32, 6, 6]          36,864
     BatchNorm2d-349           [-1, 1472, 6, 6]           2,944
            ReLU-350           [-1, 1472, 6, 6]               0
          Conv2d-351            [-1, 128, 6, 6]         188,416
     BatchNorm2d-352            [-1, 128, 6, 6]             256
            ReLU-353            [-1, 128, 6, 6]               0
          Conv2d-354             [-1, 32, 6, 6]          36,864
     BatchNorm2d-355           [-1, 1504, 6, 6]           3,008
            ReLU-356           [-1, 1504, 6, 6]               0
          Conv2d-357            [-1, 128, 6, 6]         192,512
     BatchNorm2d-358            [-1, 128, 6, 6]             256
            ReLU-359            [-1, 128, 6, 6]               0
          Conv2d-360             [-1, 32, 6, 6]          36,864
     BatchNorm2d-361           [-1, 1536, 6, 6]           3,072
            ReLU-362           [-1, 1536, 6, 6]               0
          Conv2d-363            [-1, 128, 6, 6]         196,608
     BatchNorm2d-364            [-1, 128, 6, 6]             256
            ReLU-365            [-1, 128, 6, 6]               0
          Conv2d-366             [-1, 32, 6, 6]          36,864
     BatchNorm2d-367           [-1, 1568, 6, 6]           3,136
            ReLU-368           [-1, 1568, 6, 6]               0
          Conv2d-369            [-1, 128, 6, 6]         200,704
     BatchNorm2d-370            [-1, 128, 6, 6]             256
            ReLU-371            [-1, 128, 6, 6]               0
          Conv2d-372             [-1, 32, 6, 6]          36,864
     BatchNorm2d-373           [-1, 1600, 6, 6]           3,200
            ReLU-374           [-1, 1600, 6, 6]               0
          Conv2d-375            [-1, 128, 6, 6]         204,800
     BatchNorm2d-376            [-1, 128, 6, 6]             256
            ReLU-377            [-1, 128, 6, 6]               0
          Conv2d-378             [-1, 32, 6, 6]          36,864
     BatchNorm2d-379           [-1, 1632, 6, 6]           3,264
            ReLU-380           [-1, 1632, 6, 6]               0
          Conv2d-381            [-1, 128, 6, 6]         208,896
     BatchNorm2d-382            [-1, 128, 6, 6]             256
            ReLU-383            [-1, 128, 6, 6]               0
          Conv2d-384             [-1, 32, 6, 6]          36,864
     BatchNorm2d-385           [-1, 1664, 6, 6]           3,328
            ReLU-386           [-1, 1664, 6, 6]               0
          Conv2d-387            [-1, 128, 6, 6]         212,992
     BatchNorm2d-388            [-1, 128, 6, 6]             256
            ReLU-389            [-1, 128, 6, 6]               0
          Conv2d-390             [-1, 32, 6, 6]          36,864
     BatchNorm2d-391           [-1, 1696, 6, 6]           3,392
            ReLU-392           [-1, 1696, 6, 6]               0
          Conv2d-393            [-1, 128, 6, 6]         217,088
     BatchNorm2d-394            [-1, 128, 6, 6]             256
            ReLU-395            [-1, 128, 6, 6]               0
          Conv2d-396             [-1, 32, 6, 6]          36,864
     BatchNorm2d-397           [-1, 1728, 6, 6]           3,456
            ReLU-398           [-1, 1728, 6, 6]               0
          Conv2d-399            [-1, 128, 6, 6]         221,184
     BatchNorm2d-400            [-1, 128, 6, 6]             256
            ReLU-401            [-1, 128, 6, 6]               0
          Conv2d-402             [-1, 32, 6, 6]          36,864
     BatchNorm2d-403           [-1, 1760, 6, 6]           3,520
            ReLU-404           [-1, 1760, 6, 6]               0
          Conv2d-405            [-1, 128, 6, 6]         225,280
     BatchNorm2d-406            [-1, 128, 6, 6]             256
            ReLU-407            [-1, 128, 6, 6]               0
          Conv2d-408             [-1, 32, 6, 6]          36,864
     BatchNorm2d-409           [-1, 1792, 6, 6]           3,584
            ReLU-410           [-1, 1792, 6, 6]               0
          Conv2d-411            [-1, 896, 6, 6]       1,605,632
       AvgPool2d-412            [-1, 896, 3, 3]               0
     BatchNorm2d-413            [-1, 896, 3, 3]           1,792
            ReLU-414            [-1, 896, 3, 3]               0
          Conv2d-415            [-1, 128, 3, 3]         114,688
     BatchNorm2d-416            [-1, 128, 3, 3]             256
            ReLU-417            [-1, 128, 3, 3]               0
          Conv2d-418             [-1, 32, 3, 3]          36,864
     BatchNorm2d-419            [-1, 928, 3, 3]           1,856
            ReLU-420            [-1, 928, 3, 3]               0
          Conv2d-421            [-1, 128, 3, 3]         118,784
     BatchNorm2d-422            [-1, 128, 3, 3]             256
            ReLU-423            [-1, 128, 3, 3]               0
          Conv2d-424             [-1, 32, 3, 3]          36,864
     BatchNorm2d-425            [-1, 960, 3, 3]           1,920
            ReLU-426            [-1, 960, 3, 3]               0
          Conv2d-427            [-1, 128, 3, 3]         122,880
     BatchNorm2d-428            [-1, 128, 3, 3]             256
            ReLU-429            [-1, 128, 3, 3]               0
          Conv2d-430             [-1, 32, 3, 3]          36,864
     BatchNorm2d-431            [-1, 992, 3, 3]           1,984
            ReLU-432            [-1, 992, 3, 3]               0
          Conv2d-433            [-1, 128, 3, 3]         126,976
     BatchNorm2d-434            [-1, 128, 3, 3]             256
            ReLU-435            [-1, 128, 3, 3]               0
          Conv2d-436             [-1, 32, 3, 3]          36,864
     BatchNorm2d-437           [-1, 1024, 3, 3]           2,048
            ReLU-438           [-1, 1024, 3, 3]               0
          Conv2d-439            [-1, 128, 3, 3]         131,072
     BatchNorm2d-440            [-1, 128, 3, 3]             256
            ReLU-441            [-1, 128, 3, 3]               0
          Conv2d-442             [-1, 32, 3, 3]          36,864
     BatchNorm2d-443           [-1, 1056, 3, 3]           2,112
            ReLU-444           [-1, 1056, 3, 3]               0
          Conv2d-445            [-1, 128, 3, 3]         135,168
     BatchNorm2d-446            [-1, 128, 3, 3]             256
            ReLU-447            [-1, 128, 3, 3]               0
          Conv2d-448             [-1, 32, 3, 3]          36,864
     BatchNorm2d-449           [-1, 1088, 3, 3]           2,176
            ReLU-450           [-1, 1088, 3, 3]               0
          Conv2d-451            [-1, 128, 3, 3]         139,264
     BatchNorm2d-452            [-1, 128, 3, 3]             256
            ReLU-453            [-1, 128, 3, 3]               0
          Conv2d-454             [-1, 32, 3, 3]          36,864
     BatchNorm2d-455           [-1, 1120, 3, 3]           2,240
            ReLU-456           [-1, 1120, 3, 3]               0
          Conv2d-457            [-1, 128, 3, 3]         143,360
     BatchNorm2d-458            [-1, 128, 3, 3]             256
            ReLU-459            [-1, 128, 3, 3]               0
          Conv2d-460             [-1, 32, 3, 3]          36,864
     BatchNorm2d-461           [-1, 1152, 3, 3]           2,304
            ReLU-462           [-1, 1152, 3, 3]               0
          Conv2d-463            [-1, 128, 3, 3]         147,456
     BatchNorm2d-464            [-1, 128, 3, 3]             256
            ReLU-465            [-1, 128, 3, 3]               0
          Conv2d-466             [-1, 32, 3, 3]          36,864
     BatchNorm2d-467           [-1, 1184, 3, 3]           2,368
            ReLU-468           [-1, 1184, 3, 3]               0
          Conv2d-469            [-1, 128, 3, 3]         151,552
     BatchNorm2d-470            [-1, 128, 3, 3]             256
            ReLU-471            [-1, 128, 3, 3]               0
          Conv2d-472             [-1, 32, 3, 3]          36,864
     BatchNorm2d-473           [-1, 1216, 3, 3]           2,432
            ReLU-474           [-1, 1216, 3, 3]               0
          Conv2d-475            [-1, 128, 3, 3]         155,648
     BatchNorm2d-476            [-1, 128, 3, 3]             256
            ReLU-477            [-1, 128, 3, 3]               0
          Conv2d-478             [-1, 32, 3, 3]          36,864
     BatchNorm2d-479           [-1, 1248, 3, 3]           2,496
            ReLU-480           [-1, 1248, 3, 3]               0
          Conv2d-481            [-1, 128, 3, 3]         159,744
     BatchNorm2d-482            [-1, 128, 3, 3]             256
            ReLU-483            [-1, 128, 3, 3]               0
          Conv2d-484             [-1, 32, 3, 3]          36,864
     BatchNorm2d-485           [-1, 1280, 3, 3]           2,560
            ReLU-486           [-1, 1280, 3, 3]               0
          Conv2d-487            [-1, 128, 3, 3]         163,840
     BatchNorm2d-488            [-1, 128, 3, 3]             256
            ReLU-489            [-1, 128, 3, 3]               0
          Conv2d-490             [-1, 32, 3, 3]          36,864
     BatchNorm2d-491           [-1, 1312, 3, 3]           2,624
            ReLU-492           [-1, 1312, 3, 3]               0
          Conv2d-493            [-1, 128, 3, 3]         167,936
     BatchNorm2d-494            [-1, 128, 3, 3]             256
            ReLU-495            [-1, 128, 3, 3]               0
          Conv2d-496             [-1, 32, 3, 3]          36,864
     BatchNorm2d-497           [-1, 1344, 3, 3]           2,688
            ReLU-498           [-1, 1344, 3, 3]               0
          Conv2d-499            [-1, 128, 3, 3]         172,032
     BatchNorm2d-500            [-1, 128, 3, 3]             256
            ReLU-501            [-1, 128, 3, 3]               0
          Conv2d-502             [-1, 32, 3, 3]          36,864
     BatchNorm2d-503           [-1, 1376, 3, 3]           2,752
            ReLU-504           [-1, 1376, 3, 3]               0
          Conv2d-505            [-1, 128, 3, 3]         176,128
     BatchNorm2d-506            [-1, 128, 3, 3]             256
            ReLU-507            [-1, 128, 3, 3]               0
          Conv2d-508             [-1, 32, 3, 3]          36,864
     BatchNorm2d-509           [-1, 1408, 3, 3]           2,816
            ReLU-510           [-1, 1408, 3, 3]               0
          Conv2d-511            [-1, 128, 3, 3]         180,224
     BatchNorm2d-512            [-1, 128, 3, 3]             256
            ReLU-513            [-1, 128, 3, 3]               0
          Conv2d-514             [-1, 32, 3, 3]          36,864
     BatchNorm2d-515           [-1, 1440, 3, 3]           2,880
            ReLU-516           [-1, 1440, 3, 3]               0
          Conv2d-517            [-1, 128, 3, 3]         184,320
     BatchNorm2d-518            [-1, 128, 3, 3]             256
            ReLU-519            [-1, 128, 3, 3]               0
          Conv2d-520             [-1, 32, 3, 3]          36,864
     BatchNorm2d-521           [-1, 1472, 3, 3]           2,944
            ReLU-522           [-1, 1472, 3, 3]               0
          Conv2d-523            [-1, 128, 3, 3]         188,416
     BatchNorm2d-524            [-1, 128, 3, 3]             256
            ReLU-525            [-1, 128, 3, 3]               0
          Conv2d-526             [-1, 32, 3, 3]          36,864
     BatchNorm2d-527           [-1, 1504, 3, 3]           3,008
            ReLU-528           [-1, 1504, 3, 3]               0
          Conv2d-529            [-1, 128, 3, 3]         192,512
     BatchNorm2d-530            [-1, 128, 3, 3]             256
            ReLU-531            [-1, 128, 3, 3]               0
          Conv2d-532             [-1, 32, 3, 3]          36,864
     BatchNorm2d-533           [-1, 1536, 3, 3]           3,072
            ReLU-534           [-1, 1536, 3, 3]               0
          Conv2d-535            [-1, 128, 3, 3]         196,608
     BatchNorm2d-536            [-1, 128, 3, 3]             256
            ReLU-537            [-1, 128, 3, 3]               0
          Conv2d-538             [-1, 32, 3, 3]          36,864
     BatchNorm2d-539           [-1, 1568, 3, 3]           3,136
            ReLU-540           [-1, 1568, 3, 3]               0
          Conv2d-541            [-1, 128, 3, 3]         200,704
     BatchNorm2d-542            [-1, 128, 3, 3]             256
            ReLU-543            [-1, 128, 3, 3]               0
          Conv2d-544             [-1, 32, 3, 3]          36,864
     BatchNorm2d-545           [-1, 1600, 3, 3]           3,200
            ReLU-546           [-1, 1600, 3, 3]               0
          Conv2d-547            [-1, 128, 3, 3]         204,800
     BatchNorm2d-548            [-1, 128, 3, 3]             256
            ReLU-549            [-1, 128, 3, 3]               0
          Conv2d-550             [-1, 32, 3, 3]          36,864
     BatchNorm2d-551           [-1, 1632, 3, 3]           3,264
            ReLU-552           [-1, 1632, 3, 3]               0
          Conv2d-553            [-1, 128, 3, 3]         208,896
     BatchNorm2d-554            [-1, 128, 3, 3]             256
            ReLU-555            [-1, 128, 3, 3]               0
          Conv2d-556             [-1, 32, 3, 3]          36,864
     BatchNorm2d-557           [-1, 1664, 3, 3]           3,328
            ReLU-558           [-1, 1664, 3, 3]               0
          Conv2d-559            [-1, 128, 3, 3]         212,992
     BatchNorm2d-560            [-1, 128, 3, 3]             256
            ReLU-561            [-1, 128, 3, 3]               0
          Conv2d-562             [-1, 32, 3, 3]          36,864
     BatchNorm2d-563           [-1, 1696, 3, 3]           3,392
            ReLU-564           [-1, 1696, 3, 3]               0
          Conv2d-565            [-1, 128, 3, 3]         217,088
     BatchNorm2d-566            [-1, 128, 3, 3]             256
            ReLU-567            [-1, 128, 3, 3]               0
          Conv2d-568             [-1, 32, 3, 3]          36,864
     BatchNorm2d-569           [-1, 1728, 3, 3]           3,456
            ReLU-570           [-1, 1728, 3, 3]               0
          Conv2d-571            [-1, 128, 3, 3]         221,184
     BatchNorm2d-572            [-1, 128, 3, 3]             256
            ReLU-573            [-1, 128, 3, 3]               0
          Conv2d-574             [-1, 32, 3, 3]          36,864
     BatchNorm2d-575           [-1, 1760, 3, 3]           3,520
            ReLU-576           [-1, 1760, 3, 3]               0
          Conv2d-577            [-1, 128, 3, 3]         225,280
     BatchNorm2d-578            [-1, 128, 3, 3]             256
            ReLU-579            [-1, 128, 3, 3]               0
          Conv2d-580             [-1, 32, 3, 3]          36,864
     BatchNorm2d-581           [-1, 1792, 3, 3]           3,584
            ReLU-582           [-1, 1792, 3, 3]               0
          Conv2d-583            [-1, 128, 3, 3]         229,376
     BatchNorm2d-584            [-1, 128, 3, 3]             256
            ReLU-585            [-1, 128, 3, 3]               0
          Conv2d-586             [-1, 32, 3, 3]          36,864
     BatchNorm2d-587           [-1, 1824, 3, 3]           3,648
            ReLU-588           [-1, 1824, 3, 3]               0
          Conv2d-589            [-1, 128, 3, 3]         233,472
     BatchNorm2d-590            [-1, 128, 3, 3]             256
            ReLU-591            [-1, 128, 3, 3]               0
          Conv2d-592             [-1, 32, 3, 3]          36,864
     BatchNorm2d-593           [-1, 1856, 3, 3]           3,712
            ReLU-594           [-1, 1856, 3, 3]               0
          Conv2d-595            [-1, 128, 3, 3]         237,568
     BatchNorm2d-596            [-1, 128, 3, 3]             256
            ReLU-597            [-1, 128, 3, 3]               0
          Conv2d-598             [-1, 32, 3, 3]          36,864
     BatchNorm2d-599           [-1, 1888, 3, 3]           3,776
            ReLU-600           [-1, 1888, 3, 3]               0
          Conv2d-601            [-1, 128, 3, 3]         241,664
     BatchNorm2d-602            [-1, 128, 3, 3]             256
            ReLU-603            [-1, 128, 3, 3]               0
          Conv2d-604             [-1, 32, 3, 3]          36,864
     BatchNorm2d-605           [-1, 1920, 3, 3]           3,840
          Linear-606                    [-1, 2]           3,842
================================================================
Total params: 18,096,770
Trainable params: 18,096,770
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 80.67
Params size (MB): 69.03
Estimated Total Size (MB): 149.81
----------------------------------------------------------------